In [ ]:
# Topics to complete-
# (1) Statistical Functions
# (2) Data Transformations

In [ ]:
# pandas => enables all functions - MS Excel

In [5]:
# Importing important libraries
import pandas as pd
import numpy as np

In [ ]:
# Fundamental difference between
# python list - different data types - str, int, list, dict....
# numpy array - homogenous - same - str

In [38]:
# Load or import dataset

# Import or read octane.csv
# read_csv function in pandas
df = pd.read_csv('Octane.csv')

In [39]:
df.head()

   Sample  Material1  Material2  Material3  Condition  Octane
0       1      55.33       1.72         54    1.66219   92.19
1       2      59.13       1.20         53    1.58399   92.74
2       3      57.39       1.42         55    1.61731   91.88
3       4      56.43       1.78         55    1.66228   92.80
4       5      55.98       1.58         54    1.63195   92.56

In [ ]:
# Tell the number of null values in each column

In [10]:
df.isnull().sum()

Sample       0
Material1    0
Material2    0
Material3    0
Condition    0
Octane       0
dtype: int64

In [11]:
# Schema of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Sample     82 non-null     int64
 1   Material1  82 non-null     float64
 2   Material2  82 non-null     float64
 3   Material3  82 non-null     int64
 4   Condition  82 non-null     float64
 5   Octane     82 non-null     float64
dtypes: float64(4), int64(2)
memory usage: 4.0 KB

In [ ]:
# Caluclate the mean of each column in df
# assign each mean to its separate variable
# Wrtie a function for this - takes a dataframe and the column 
# and returns its mean

mat_2_mean
sample_mean

In [13]:
mat_1_mean = df['Material1'].mean()

In [14]:
mat_1_mean

60.170609756097555

In [43]:
def col_mean(df, col):
    result = None
    df_cols = df.columns
    if col in df_cols:
        result = df[col].mean()
    
    return result

In [ ]:
def col_mean(df, col):
    result = None
    df_cols = df.columns
    if col in df_cols:
        result = df[col].mean()
    else:
        return result

In [44]:
df.columns

Index(['Sample', 'Material1', 'Material2', 'Material3', 'Condition', 'Octane'], dtype='object')

In [ ]:
col_mean(df, 'xyz')

In [45]:
df['xyz']

KeyError: 'xyz'

In [20]:
data = df.columns

In [33]:
def input_mean(data):
    print(data)
    for i in data:
        df[i] = df[i].mean()

In [40]:
df

    Sample  Material1  Material2  Material3  Condition  Octane
0        1      55.33       1.72         54    1.66219   92.19
1        2      59.13       1.20         53    1.58399   92.74
2        3      57.39       1.42         55    1.61731   91.88
3        4      56.43       1.78         55    1.66228   92.80
4        5      55.98       1.58         54    1.63195   92.56
..     ...        ...        ...        ...        ...     ...
77      78      67.60       1.84         55    1.64758   91.86
78      79      64.81       2.24         54    1.69592   91.61
79      80      63.13       1.60         52    1.66118   92.17
80      81      63.48       3.46         52    1.48216   91.56
81      82      62.25       3.56         50    1.49734   92.16

[82 rows x 6 columns]

In [36]:
df1 = df

In [37]:
input_mean(df1)

    Sample  Material1  Material2  Material3  Condition     Octane
0     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
1     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
2     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
3     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
4     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
..     ...        ...        ...        ...        ...        ...
77    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
78    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
79    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
80    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
81    41.5   60.17061   1.663659  55.463415   1.626571  91.849878

[82 rows x 6 columns]

In [42]:
df1

    Sample  Material1  Material2  Material3  Condition     Octane
0     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
1     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
2     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
3     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
4     41.5   60.17061   1.663659  55.463415   1.626571  91.849878
..     ...        ...        ...        ...        ...        ...
77    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
78    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
79    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
80    41.5   60.17061   1.663659  55.463415   1.626571  91.849878
81    41.5   60.17061   1.663659  55.463415   1.626571  91.849878

[82 rows x 6 columns]

In [22]:
mat_1_mean = col_mean(df, 'Material1')

60.170609756097555

In [24]:
print(mat_1_mean)

None

In [18]:
col_mean(df, col='Material1')

AttributeError: 'DataFrame' object has no attribute 'col'

In [12]:
df.mean()

Sample       41.500000
Material1    60.170610
Material2     1.663659
Material3    55.463415
Condition     1.626571
Octane       91.849878
dtype: float64

In [2]:
# Importing the dataset
df = pd.read_csv('Octane.csv')
df.head()

NameError: name 'pd' is not defined

In [46]:
# Calculating mean for Material1, Material2, Material3, Condition and Octane columns
m1_mean = df['Material1'].mean()
m2_mean = df['Material2'].mean()
m3_mean = df['Material3'].mean()
cond_mean = df['Condition'].mean()
octane_mean = df['Octane'].mean()
print('Mean value for Material 1 is : ', m1_mean)
print('Mean value for Material 2 is : ', m2_mean)
print('Mean value for Material 3 is : ', m3_mean)
print('Mean value for Condition is : ', cond_mean)
print('Mean value for Octane is : ', octane_mean)

Mean value for Material 1 is :  60.170609756097555
Mean value for Material 2 is :  1.663658536585366
Mean value for Material 3 is :  55.46341463414634
Mean value for Condition is :  1.6265713414634146
Mean value for Octane is :  91.84987804878048

In [ ]:
# Function that takes a df and col
# Checks iof given col is present in df
# if present returns median
# if not returns null

def col_median(df, col):
    <fill this>
    return <something>

In [ ]:
def col_median(df, col):
    result = None
    df_cols = df.columns
    if col in df_cols:
        result = df[col].median()
    else:
        return result

In [4]:
# Calculating median for Material1, Material2, Material3, Condition and Octane columns
m1_mdn = df['Material1'].median()
m2_mdn = df['Material2'].median()
m3_mdn = df['Material3'].median()
cond_mdn = df['Condition'].median()
octane_mdn = df['Octane'].median()
print('Median value for Material 1 is : ', m1_mdn)
print('Median value for Material 2 is : ', m2_mdn)
print('Median value for Material 3 is : ', m3_mdn)
print('Median value for Condition is : ', cond_mdn)
print('Median value for Octane is : ', octane_mdn)

Median value for Material 1 is :  62.695
Median value for Material 2 is :  1.28
Median value for Material 3 is :  56.0
Median value for Condition is :  1.6035750000000002
Median value for Octane is :  91.735

In [5]:
# Calculating mode for Material1, Material2, Material3, Condition and Octane columns
m1_mde = df['Material1'].mode()
m2_mde = df['Material2'].mode()
m3_mde = df['Material3'].mode()
cond_mde = df['Condition'].mode()
octane_mde = df['Octane'].mode()
print('Mode value for Material 1 is : ', m1_mde)
print('Mode value for Material 2 is : ', m2_mde)
print('Mode value for Material 3 is : ', m3_mde)
print('Mode value for Condition is : ', cond_mde)
print('Mode value for Octane is : ', octane_mde)

Mode value for Material 1 is :  0      4.23
1      5.53
2     17.11
3     44.64
4     44.66
      ...
77    72.30
78    72.66
79    73.13
80    73.74
81    75.54
Length: 82, dtype: float64
Mode value for Material 2 is :  0    0.0
dtype: float64
Mode value for Material 3 is :  0    55
dtype: int64
Mode value for Condition is :  0     1.19975
1     1.20817
2     1.26174
3     1.28802
4     1.29842
       ...
77    2.08081
78    2.14314
79    2.17070
80    2.17140
81    2.31909
Length: 82, dtype: float64
Mode value for Octane is :  0    91.56
1    91.61
2    92.16
dtype: float64

In [47]:
df

    Sample  Material1  Material2  Material3  Condition  Octane
0        1      55.33       1.72         54    1.66219   92.19
1        2      59.13       1.20         53    1.58399   92.74
2        3      57.39       1.42         55    1.61731   91.88
3        4      56.43       1.78         55    1.66228   92.80
4        5      55.98       1.58         54    1.63195   92.56
..     ...        ...        ...        ...        ...     ...
77      78      67.60       1.84         55    1.64758   91.86
78      79      64.81       2.24         54    1.69592   91.61
79      80      63.13       1.60         52    1.66118   92.17
80      81      63.48       3.46         52    1.48216   91.56
81      82      62.25       3.56         50    1.49734   92.16

[82 rows x 6 columns]

In [48]:
df['Material1'].max()

75.54

In [50]:
df['Material1'].min()

4.23

In [ ]:
# Calculate the range for every column
# Round it to first decimal
# function to do this

# function takes df and col, returns range

def col_range(df, col):
    
    df_cols = df.columns
    if col in df_cols:
        col_max = df[col].max()
        col_min = df[col].min()
        return col_max - col_min
    return None

In [ ]:
# mean = "50+42+45+100"/"1+1+1+1"

In [ ]:
# What is Range?

In [58]:
# Return Interquartile Range
# What is IQR?
# Use df.quantile()
# Write a function that takes df, col and returns its IQR

def IQR(df, col):
    
    df_cols = df.columns
    if col in df_cols:
        col_q3 = df[col].quantile(0.75)
        col_q1 = df[col].quantile(0.25)
        return col_q3 - col_q1
    return None

In [56]:
df['Sample'].quantile(0.25)

21.25

In [57]:
df['Sample'].quantile(0.75)

61.75

In [53]:
df.median()

Sample       41.500000
Material1    62.695000
Material2     1.280000
Material3    56.000000
Condition     1.603575
Octane       91.735000
dtype: float64

In [6]:
# Calculating count() for Material1, Material2, Material3, Condition and Octane columns
m1_cnt = df['Material1'].count()
m2_cnt = df['Material2'].count()
m3_cnt = df['Material3'].count()
cond_cnt = df['Condition'].count()
octane_cnt = df['Octane'].count()
print('Count for Material 1 is : ', m1_cnt)
print('Count for Material 2 is : ', m2_cnt)
print('Count for Material 3 is : ', m3_cnt)
print('Count for Condition is : ', cond_cnt)
print('Count for Octane is : ', octane_cnt)

Count for Material 1 is :  82
Count for Material 2 is :  82
Count for Material 3 is :  82
Count for Condition is :  82
Count for Octane is :  82

In [7]:
# Printing the shape of df
print(df.shape)

(82, 6)

In [ ]:
# unique() : gives you unique values.
# nunique() : gives you number of rows with unique values.

In [8]:
# Calculating standard deviation for Material1, Material2, Material3, Condition and Octane columns
m1_std = df['Material1'].std()
m2_std = df['Material2'].std()
m3_std = df['Material3'].std()
cond_std = df['Condition'].std()
octane_std = df['Octane'].std()
print('Standard Deviation for Material 1 is : ', m1_std)
print('Standard Deviation for Material 2 is : ', m2_std)
print('Standard Deviation for Material 3 is : ', m3_std)
print('Standard Deviation for Condition is : ', cond_std)
print('Standard Deviation for Octane is : ', octane_std)

Standard Deviation for Material 1 is :  12.43739992552937
Standard Deviation for Material 2 is :  1.9019518968064713
Standard Deviation for Material 3 is :  5.377582921059387
Standard Deviation for Condition is :  0.2197298227524435
Standard Deviation for Octane is :  1.4011243226995749

In [9]:
# Calculating minimum for Material1, Material2, Material3, Condition and Octane columns
m1_min = df['Material1'].min()
m2_min = df['Material2'].min()
m3_min = df['Material3'].min()
cond_min = df['Condition'].min()
octane_min = df['Octane'].min()
print('Minimum for Material 1 is : ', m1_min)
print('Minimum for Material 2 is : ', m2_min)
print('Minimum for Material 3 is : ', m3_min)
print('Minimum for Condition is : ', cond_min)
print('Minimum for Octane is : ', octane_min)

Minimum for Material 1 is :  4.23
Minimum for Material 2 is :  0.0
Minimum for Material 3 is :  40
Minimum for Condition is :  1.19975
Minimum for Octane is :  89.66

In [10]:
# Calculating maximum for Material1, Material2, Material3, Condition and Octane columns
m1_max = df['Material1'].max()
m2_max = df['Material2'].max()
m3_max = df['Material3'].max()
cond_max = df['Condition'].max()
octane_max = df['Octane'].max()
print('Maximum for Material 1 is : ', m1_max)
print('Maximum for Material 2 is : ', m2_max)
print('Maximum for Material 3 is : ', m3_max)
print('Maximum for Condition is : ', cond_max)
print('Maximum for Octane is : ', octane_max)

Maximum for Material 1 is :  75.54
Maximum for Material 2 is :  10.76
Maximum for Material 3 is :  64
Maximum for Condition is :  2.31909
Maximum for Octane is :  97.61

In [13]:
# Getting all the statistical parameters in one command
df.describe()

          Sample  Material1  Material2  Material3  Condition     Octane
count  82.000000   82.00000  82.000000  82.000000  82.000000  82.000000
mean   41.500000   60.17061   1.663659  55.463415   1.626571  91.849878
std    23.815261   12.43740   1.901952   5.377583   0.219730   1.401124
min     1.000000    4.23000   0.000000  40.000000   1.199750  89.660000
25%    21.250000   55.38000   0.105000  54.000000   1.518095  90.847500
50%    41.500000   62.69500   1.280000  56.000000   1.603575  91.735000
75%    61.750000   67.78000   2.277500  59.750000   1.722818  92.467500
max    82.000000   75.54000  10.760000  64.000000   2.319090  97.610000

In [ ]:
# Data Transformations

In [60]:
# Importing new dataset
df = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv',index_col=0)
df.head()

            Age  Gender      Grade Employed
Student_id
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no

In [ ]:
# Skewed distribution

# Types of skewed distribution

In [61]:
# Command to include and exclude columns of numeric data type
df_numeric = df.select_dtypes(include = [np.number])
df_numeric.head()

            Age
Student_id
1            19
2            20
3            18
4            21
5            19

In [62]:
# Command to include and exclude columns of numeric data type
df_categorical = df.select_dtypes(exclude = [np.number])
df_categorical.head()

            Gender      Grade Employed
Student_id
1             Male  1st Class      yes
2           Female  2nd Class       no
3             Male  1st Class       no
4           Female  2nd Class       no
5             Male  1st Class       no

In [28]:
# Getting unique values from Material 3 column
print(df['Grade'].unique())

['1st Class' '2nd Class' '3rd Class']

In [29]:
# Getting number of unique values from Material 3 column
print(df['Grade'].nunique())

3

In [30]:
# Getting the proportion of categories from categorical columns
df['Grade'].value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [31]:
# Getting the proportion of categories from categorical columns
df['Gender'].value_counts()

Male      136
Female     96
Name: Gender, dtype: int64

In [33]:
# Getting the proportion of categories from categorical columns
df['Employed'].value_counts()

no     133
yes     99
Name: Employed, dtype: int64

In [63]:
df

            Age  Gender      Grade Employed
Student_id
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no
...         ...     ...        ...      ...
228          21  Female  1st Class       no
229          20    Male  2nd Class       no
230          20    Male  3rd Class      yes
231          19  Female  1st Class      yes
232          20    Male  3rd Class      yes

[232 rows x 4 columns]

In [65]:
# List all possible unique values for Gender, Grade, Employed

# Write it as a function

def col_unique(df, col):
    result=None 
    if col in df.columns: 
        return(df[col].unique()) 
    return(result)

In [66]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [67]:
col_unique(df, 'Gender')

array(['Male', 'Female'], dtype=object)

In [68]:
col_unique(df, 'Grade')

array(['1st Class', '2nd Class', '3rd Class'], dtype=object)

In [69]:
# Replace these with a numerical value
# Gender - Male with 0, Female with 1 - and create a new column - 
# Gender_OHE


# Grade - 1st Class - 1 | 2nd Class - 2 | 3rd Class - 3 - 
# - create a new column - Grade_Label and assign it

In [ ]:
df.replace()

In [72]:
df["gender_OHE"]=df["Gender"].replace(to_replace=["Male","Female"], value=[0,1]) 
df["gender_OHE"]

Student_id
1      0
2      1
3      0
4      1
5      0
      ..
228    1
229    0
230    0
231    1
232    0
Name: gender_OHE, Length: 232, dtype: int64

In [73]:
df

            Age  Gender      Grade Employed  gender_OHE
Student_id
1            19    Male  1st Class      yes           0
2            20  Female  2nd Class       no           1
3            18    Male  1st Class       no           0
4            21  Female  2nd Class       no           1
5            19    Male  1st Class       no           0
...         ...     ...        ...      ...         ...
228          21  Female  1st Class       no           1
229          20    Male  2nd Class       no           0
230          20    Male  3rd Class      yes           0
231          19  Female  1st Class      yes           1
232          20    Male  3rd Class      yes           0

[232 rows x 5 columns]

In [ ]:
# Add a new column - gender_OHE
# Every row of this column will be 
# dependent on value of Gender

# if value of Gender == Male: value of gender_OHE = 0
# if value of Gender == Female: value of gender_OHE = 1

In [82]:
df['Gender']

Student_id
1           Male
2         Female
3           Male
4         Female
5           Male
           ...
230         Male
231       Female
232         Male
Male         NaN
Female       NaN
Name: Gender, Length: 234, dtype: object

In [77]:
df['gender_OHE'] = None

In [80]:

for i in df['Gender']:
    if i == 'Male':
        df.loc[row_idx, 'gender_OHE'] = 0
    else:
        df.loc[row_idx, 'gender_OHE'] = 1

In [90]:
len(df)

234

In [ ]:
# Using row index explicitly
for row_idx in range(len(df)):
    print(row_idx)
    if df.loc[row_idx, 'Gender'] == 'Male':
        df.loc[row_idx, 'gender_OHE'] = 0
    else:
        df.loc[row_idx, 'gender_OHE'] = 1

In [89]:
# Using row index explicitly
for row_idx in df.index:
    print(row_idx)
    if df.loc[row_idx, 'Gender'] == 'Male':
        df.loc[row_idx, 'gender_OHE'] = 0
    else:
        df.loc[row_idx, 'gender_OHE'] = 1

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143
144
145
146
147
148
149
150
151
152
153
154
155
156
157
158
159
160
161
162
163
164
165
166
167
168
169
170
171
172
173
174
175
176
177
178
179
180
181
182
183
184
185
186
187
188
189
190
191
192
193
194
195
196
197
198
199
200
201
202
203
204
205
206
207
208
209
210
211
212
213
214
215
216
217
218
219
220
221
222
223
224
225
226
227
228
229
230
231
232
Male
Female

In [88]:
df.index

Index([       1,        2,        3,        4,        5,        6,        7,
              8,        9,       10,
       ...
            225,      226,      227,      228,      229,      230,      231,
            232,   'Male', 'Female'],
      dtype='object', name='Student_id', length=234)

In [86]:
df.index

Index([       1,        2,        3,        4,        5,        6,        7,
              8,        9,       10,
       ...
            225,      226,      227,      228,      229,      230,      231,
            232,   'Male', 'Female'],
      dtype='object', name='Student_id', length=234)

In [84]:
for i in df['Gender']:
    print(i)

Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
Female
Male
Female
Male
Male
Female
Male
nan
nan

In [76]:
df.drop('gender_OHE', inplace=True, axis=1)

In [35]:
# Replacing some values
df['Gender'].replace({'Male' : 0, 'Female' : 1}, inplace = True)
df['Employed'].replace({'no' : 0, 'yes' : 1}, inplace = True)
df['Grade'].replace({'1st Class' : 1, '2nd Class' : 2, '3rd Class' : 3}, inplace = True)
df.head()

            Age  Gender  Grade  Employed
Student_id
1            19       0      1         1
2            20       1      2         0
3            18       0      1         0
4            21       1      2         0
5            19       0      1         0

In [91]:
# Basic Data Transformation
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns = ['a','b','c'])
df.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
def name_of_function(argument_of_function): 
    return result

In [ ]:
# Take x and return x squared - Named Function

def x_squared(x): return x * x
lambda x: x * x

In [ ]:
# 
lambda <x_squared_not_needed> <arg_x_needed>: <return_not_needed> <result>

In [ ]:
lambda x: x * x

In [37]:
# Applying a small transformation
df.transform(func = lambda x : x*10)

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [ ]:
lambda x : np.log(x)

In [39]:
# Applying a small transformation
df.transform(func = lambda x : np.log(x))

          a         b         c
0  0.000000  0.693147  1.098612
1  1.386294  1.609438  1.791759
2  1.945910  2.079442  2.197225

In [92]:
# Applying a small transformation
df.transform(func = lambda x : np.exp(x))

             a            b            c
0     2.718282     7.389056    20.085537
1    54.598150   148.413159   403.428793
2  1096.633158  2980.957987  8103.083928